Autodesk.Revit.DB.MEPSystemType.MaterialId
Indicates the material id that should override the material for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MEPSystemType.FillPatternId
Indicates the fill pattern id that should override the fill pattern id for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MEPSystemType.FillColor
Indicates the color that should override the fill color for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MEPSystemType.LinePatternId
Indicates the line pattern id that should override the line pattern id for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MEPSystemType.LineColor
Indicates the color that should override the line color for all components in the system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.MEPSystemType.Abbreviation
Identifies the abbreviation, the short name, for the system type
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012